//══════════════════════════════════════════════════════════════════════════════════════════════════════// 
//                                                                                                      //
//                                   MULTI-DEVICE WHATSAPP BOT                                          //
//                                                                                                      //
//                                            𝚅.𝟷.𝟻.𝟹                                                  // 
//                                                                                                      //
//              ███████╗██╗ ██████╗ ███╗   ███╗ █████╗     ███╗   ███╗██████╗                           //
//              ██╔════╝██║██╔════╝ ████╗ ████║██╔══██╗    ████╗ ████║██╔══██╗                          //
//              ███████╗██║██║  ███╗██╔████╔██║███████║    ██╔████╔██║██║  ██║                          //
//              ╚════██║██║██║   ██║██║╚██╔╝██║██╔══██║    ██║╚██╔╝██║██║  ██║                          //
//              ███████║██║╚██████╔╝██║ ╚═╝ ██║██║  ██║    ██║ ╚═╝ ██║██████╔╝                          //
//              ╚══════╝╚═╝ ╚═════╝ ╚═╝     ╚═╝╚═╝  ╚═╝    ╚═╝     ╚═╝╚═════╝                           //
//                                                                                                      //
//                                          BY:MAHER-ZUBAIR                                             //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

/**

* @project_name : SIGMA-MD
* @Developer : Maher-Zubair
* @Version : v.1.5.3
* @license : Apache-2.0

This Project Is Under Apache-2.0 License.
So, No One Have Permission To Copy This Project,
Reupload, Reversed Engineering And Any Kind Of Deobfuscation.
Otherwise, A Legal Github Copyright Action Will Be Taken Against You
Which Result In Removing The Copied Project And Permanantly Banning Of Your Account.
* @Copyright_owner : Maher-Zubair

**/

var _0x27c3=["\x6D\x65\x6D\x6F","\x63\x68\x61\x74","\x73\x65\x6E\x64\x4D\x65\x73\x73\x61\x67\x65","\x69\x6D\x61\x67\x65","\x76\x69\x64\x65\x6F","\x61\x75\x64\x69\x6F","\x65\x78\x70\x6F\x72\x74\x73"];async function mz(_0x5dbcx2,_0x5dbcx3,_0x5dbcx4,_0x5dbcx5= _0x27c3[0]){let _0x5dbcx6=_0x5dbcx3[_0x27c3[1]];try{if(_0x5dbcx5== _0x27c3[0]){return  await _0x5dbcx2[_0x27c3[2]](_0x5dbcx6,{memo:_0x5dbcx4},{quoted:_0x5dbcx3})}else {if(_0x5dbcx5== _0x27c3[3]){return  await _0x5dbcx2[_0x27c3[2]](_0x5dbcx6,{image:{url:_0x5dbcx4}},{quoted:_0x5dbcx3})}else {if(_0x5dbcx5== _0x27c3[4]){return  await _0x5dbcx2[_0x27c3[2]](_0x5dbcx6,{video:{url:_0x5dbcx4}},{quoted:_0x5dbcx3})}else {if(_0x5dbcx5== _0x27c3[5]){return  await _0x5dbcx2[_0x27c3[2]](_0x5dbcx6,{audio:{url:_0x5dbcx4}},{quoted:_0x5dbcx3})}}}}}catch{}}module[_0x27c3[6]]= {mz}